uhnp/src/Reports/КнигаПокупок/КнигаПокупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>КнигаПокупок</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьДополнительныеЛисты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЛистыЗаТекущийПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппироватьПоКонтрагентам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентДляОтбора</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьТолькоДопЛисты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьОбособленныеПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьПокупателейПоАвансам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

uhnp/src/Reports/КнигаПокупок/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если НачалоПериода > КонецПериода Тогда
		
		ТекстСообщения = НСтр("ru = 'Неправильно задан период формирования отчета.
			|Дата начала больше даты окончания периода.';
			|en = 'Report generation period is specified incorrectly.
			|Period start date is later than the end date.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Отчет.НачалоПериода",, Отказ);
		
	ИначеЕсли НЕ УчетНДСПереопределяемый.ДатыРасположеныВнутриОдногоНалоговогоПериода(Организация, НачалоПериода, КонецПериода) Тогда
		
		ТекстСообщения = НСтр("ru = 'Неправильно задан период формирования отчета.
			|Выберите даты внутри одного налогового периода.';
			|en = 'Incorrect report generation period.
			|Select dates within one fiscal period.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Отчет.КонецПериода",, Отказ);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
